app/views/main/inventories.html.erb

        <tr>
            <td><%=Item.where(id: i.item_id).first.name%></td>
            <td><%=i.price%></td>
            <td><%=User.where(id: (Item.where(id: i.item_id).first.user_id)).first.name%></td>
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]