app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("user_id", "name", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["name", "apple"], ["price", 15.0], ["stock", 3], ["created_at", "2022-11-02 18:01:54.118278"], ["updated_at", "2022-11-02 18:01:54.118278"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stock", 15], ["updated_at", "2022-11-02 18:11:21.270025"], ["id", 5]]