app/controllers/main_controller.rb

  def create
    u = User.where(username: params[:username]).first
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", "admin"], ["LIMIT", 1]]

  def user_item
    if mustLogin
      @item_list = Item.where(user_id: session[:user_id])
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]

  def shop
    @shopping_list = Item.where(user_id: params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 2]]

  def buy
      i = Item.where(id: params[:item_id]).first
      url = '/shop/' + params[:shop_id].to_s
      if i.stock <= 0
        redirect_to url, notice: "Buy failed, out of stock"
      else
        i.stock = i.stock-1
        i.save
        inven = Inventory.new
        inven.user_id = session[:user_id].to_i
        inven.item_id = params[:item_id].to_i
        inven.price = i.price
        inven.timestamp = Time.new
        inven.save
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stock", 9], ["updated_at", "2022-11-02 13:19:21.962023"], ["id", 2]]
INSERT INTO "inventories" ("user_id", "item_id", "price", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["item_id", 5], ["price", 20.0], ["timestamp", "2022-11-02 13:41:37.435284"], ["created_at", "2022-11-02 13:41:37.437327"], ["updated_at", "2022-11-02 13:41:37.437327"]]

  def inventories
    if mustLogin
      @inven_list = Inventory.where(user_id: session[:user_id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = ?  [["user_id", 2]]